# Importing

In [3]:
pip install pyforest

Requirement already satisfied: pyforest in c:\users\hp\anaconda3\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pyforest
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import RandomForestRegressor
from sklearn.preprocessing import LabelEncoder
from sklearn.metrics import mean_absolute_percentage_error
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
from sklearn.model_selection import GridSearchCV
from sklearn.metrics import classification_report

# Ignore warnings

In [7]:
import warnings
warnings.filterwarnings("ignore")

# Read file

In [2]:
df=pd.read_csv("E:\crome downloades\Excelr/Fraud_check.csv")
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

# Data Exploration

In [5]:
df.isnull().any()

Undergrad          False
Marital.Status     False
Taxable.Income     False
City.Population    False
Work.Experience    False
Urban              False
dtype: bool

In [6]:
df.isnull().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

# Descriptive Analysis

In [7]:
df.shape

(600, 6)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [9]:
df[df.duplicated()].shape

(0, 6)

In [10]:
df[df.duplicated()]

Empty DataFrame
Columns: [Undergrad, Marital.Status, Taxable.Income, City.Population, Work.Experience, Urban]
Index: []

In [11]:
df.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [9]:
encoder=LabelEncoder()
df['Undergrad']=encoder.fit_transform(df['Undergrad'])
df['Marital.Status']=encoder.fit_transform(df['Marital.Status'])
df['Urban']=encoder.fit_transform(df['Urban'])

In [10]:
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0
...,...,...,...,...,...,...
595,1,0,76340,39492,7,1
596,1,0,69967,55369,2,1
597,0,0,47334,154058,0,1
598,1,1,98592,180083,17,0
599,0,0,96519,158137,16,0

In [11]:
df['Taxable.Income']=df['Taxable.Income'].apply(lambda x: 1 if x>30000 else 0)

In [12]:
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,1,50047,10,1
1,1,0,1,134075,18,1
2,0,1,1,160205,30,1
3,1,2,1,193264,15,1
4,0,1,1,27533,28,0
...,...,...,...,...,...,...
595,1,0,1,39492,7,1
596,1,0,1,55369,2,1
597,0,0,1,154058,0,1
598,1,1,1,180083,17,0
599,0,0,1,158137,16,0

In [13]:
df['Taxable.Income'].value_counts()

1    476
0    124
Name: Taxable.Income, dtype: int64

In [14]:
df.isnull().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

In [15]:
df.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [16]:
df=df.reindex(columns=['Taxable.Income','Undergrad', 'Marital.Status','City.Population',
       'Work.Experience', 'Urban'])

In [17]:
df

,Taxable.Income,Undergrad,Marital.Status,City.Population,Work.Experience,Urban
0,1,0,2,50047,10,1
1,1,1,0,134075,18,1
2,1,0,1,160205,30,1
3,1,1,2,193264,15,1
4,1,0,1,27533,28,0
...,...,...,...,...,...,...
595,1,1,0,39492,7,1
596,1,1,0,55369,2,1
597,1,0,0,154058,0,1
598,1,1,1,180083,17,0
599,1,0,0,158137,16,0

In [18]:
X=df.iloc[:,1:]
Y=df.iloc[:,0]

In [19]:
X

     Undergrad  Marital.Status  City.Population  Work.Experience  Urban
0            0               2            50047               10      1
1            1               0           134075               18      1
2            0               1           160205               30      1
3            1               2           193264               15      1
4            0               1            27533               28      0
..         ...             ...              ...              ...    ...
595          1               0            39492                7      1
596          1               0            55369                2      1
597          0               0           154058                0      1
598          1               1           180083               17      0
599          0               0           158137               16      0

[600 rows x 5 columns]

In [20]:
Y

0      1
1      1
2      1
3      1
4      1
      ..
595    1
596    1
597    1
598    1
599    1
Name: Taxable.Income, Length: 600, dtype: int64

In [22]:
Y.value_counts()

1    476
0    124
Name: Taxable.Income, dtype: int64

In [24]:
x_train,x_test,y_train,y_test=train_test_split(X,Y,test_size=0.20)

In [25]:
model=RandomForestClassifier()
parameters={'n_estimators':[20,40,50,70,90,100],'criterion':['gini','entropy'],'max_features':[3,4,5]}

In [26]:
grid=GridSearchCV(model,parameters,cv=10)

In [27]:
grid.fit(x_train,y_train)

GridSearchCV(cv=10, estimator=RandomForestClassifier(),
             param_grid={'criterion': ['gini', 'entropy'],
                         'max_features': [3, 4, 5],
                         'n_estimators': [20, 40, 50, 70, 90, 100]})

In [28]:
grid.best_score_

0.75625

In [29]:
grid.best_params_

{'criterion': 'entropy', 'max_features': 4, 'n_estimators': 100}

In [30]:
final_model=RandomForestClassifier(criterion='gini',max_features=3, n_estimators=70)

In [31]:
final_model.fit(x_train,y_train)

RandomForestClassifier(max_features=3, n_estimators=70)

In [32]:
y_test_pred=final_model.predict(x_test)
y_test_pred

array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 0], dtype=int64)

In [36]:
ytp=pd.DataFrame(y_test_pred)
ytp

     0
0    1
1    1
2    1
3    1
4    1
..  ..
115  1
116  1
117  0
118  1
119  0

[120 rows x 1 columns]

In [37]:
ytp.value_counts()

1    112
0      8
dtype: int64

In [26]:
print(classification_report(y_test_pred,y_test))

              precision    recall  f1-score   support

           0       0.04      0.12      0.06         8
           1       0.93      0.80      0.86       112

    accuracy                           0.76       120
   macro avg       0.49      0.46      0.46       120
weighted avg       0.87      0.76      0.81       120